Revit 2027 API
ViewSystemsAnalysisReport.IsAnalysisCompleted Method
 Indicates if the background systems analysis has completed or not.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAnalysisCompleted()
Public Function IsAnalysisCompleted As Boolean
public:
bool IsAnalysisCompleted()
member IsAnalysisCompleted : unit -> bool
Return Value
Boolean
 True if completed, otherwise false.
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace